__1.__ Установить и настроить Airflow по материалам лекции, создать проект в PyCharm, запустить пример DAG'а из лекции на локальном компьютере и убедиться в успешном расчете пайплайна.

In [4]:
import pandas as pd
import ssl

ssl._create_default_https_context = ssl._create_unverified_context
url = "https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv"
df = pd.read_csv(url)

In [6]:
print('Dataset size:', df.shape)
df.head()

Dataset size: (887, 8)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [11]:
pd.read_csv('/home/natalie/titanic_pivot.csv')

   Unnamed: 0     Sex    1    2    3
0           0  female   94   76  144
1           1    male  122  108  343

Фаил с дагом в папке airflow_dags под названием example_dag.py

__2.__ Написать функцию __mean_fare_per_class()__, которая считывает файл titanic.csv и расчитывает среднюю арифметическую цену билета (Fare) для каждого класса (Pclass) и сохраняет результирующий датафрейм в файл __titanic_mean_fares.csv__

In [13]:
import os
import pandas as pd

def mean_fare_per_class():
    titanic_df = pd.read_csv("/home/natalie/titanic.csv")
    df = titanic_df[['Pclass','Fare']].groupby('Pclass').mean()
    df.to_csv('/home/natalie/titanic_mean_fares.csv')
    print(df)

mean_fare_per_class()

             Fare
Pclass
1       84.154687
2       20.662183
3       13.707707

__3.__ Добавить в DAG таск с названием __mean_fares_titanic_dataset__, который будет исполнять функцию mean_fare_per_class(), причем эта задача должна запускаться в параллель с pivot_titanic_dataset после таски create_titanic_dataset.

таска добавлена в DAG: HW2_titanic
<img src="../images/HW/titanic.png" style="width: 500px;">

__4.__ В конец пайплайна (после завершения тасок pivot_titanic_dataset и mean_fares_titanic_dataset) добавить шаг с названием __last_task__, на котором в STDOUT выводится строка, сообщающая об окончании расчета и выводящая execution date в формате YYYY-MM-DD. Пример строки: "Pipeline finished! Execution date is 2020-12-28"

таска добавлена в DAG: HW2_titanic
<img src="../images/HW/titanic_last.png" style="width: 600px;">
<img src="../images/HW/titanic_last_log.png" style="width: 600px;">